{
  "main": {
    "name": "Amir Nazari",
    "occupation": "Full-Stack Developer",
    "description": "I'm the type of person that loves hard problems. I'm a responsible person because my codes are like my children.",
    "image": "profilepic.jpg",
    "bio": "Solution-driven professional excelling in a highly collaborative work environment, finding solutions to challenges, and focused on customer satisfaction. Hardworking Golang, Python, and Java Developer are enthusiastic about working with multicultural teams. Proven experience developing consumer-focused web sites using HTML, CSS, JavaScript, React JS, and JQuery. Experience building products for desktop, and mobile app (React Native) users, meeting highest standards for web design, user experience, best practices, usability, and speed. Skill developing microservices with gRPC and protocol buffer and using MongoDB, MySQL, and Redis for storing data and NATs for communicating between services. Responding to challenges by designing and developing solutions and building web applications aligned to customer's services. Translating solutions into code and working across many different APIs(like REST and Graphql with ApolloGraph), third-party integrations, and databases. Effective at working in Agile environments using SCRUM methodologies. I enjoy learning new things and can assimilate new ideas quickly.",
    "contactmessage": "If you'd like to make an enquiry, please feel free to get in touch, and I will respond as soon as possible. If you prefer to contact me directly, send your Email to: a.nazari5868@gmail.com",
    "email": "a.nazari5868@gmail.com",
    "phone": "+989012895868",
    "address": {
      "city": "Tehran",
      "state": "Tehran"
    },
    "website": "https://anazari.me",
    "resumedownload": "/Resume.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/a.nzr.96/",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/amirnazari96",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/amirnazari96/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/anazari96",
        "className": "fa fa-github"
      },
      {
        "name": "skype",
        "url": "live:persianamir96",
        "className": "fa fa-skype"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm a programming lover and this list is going to be infinite.",
    "work": [
      {
        "company": "Profile Company, Mashhad, Khorasan Razavi",
        "title": "Senior Full-Stack Developer",
        "years": "3/2019 – CURRENT",
        "description": "React developer works with Redux, Redux-Saga, Graphql, Apollograph, immutable-js, webpack, babel, sentry, typescript, and a lot more packages related. React Native developer to write Ios and Android application with RNN(Wix), Firebase. Working with pure javascript for part of the project and web-component. Working on the webinar and accounting system. Using BigBlueButton for the webinar system and implemented a middleware service to connect the product to this third party program with Golang, MySQL, MongoDB, gRPC, Protobuf, and Graphql."
      },
      {
        "company": "Agrimetsoft Company, Mashhad, Khorasan Razavi",
        "title": "Web Designer/Developer",
        "years": "1/2019 – 3/2019",
        "description": "Completed full redesigns of existing websites to improve navigation, enhance visuals, and strengthen search engine rankings. Designed and executed security measures such as firewalls and encryption. Created site layout and user interface using HTML and CSS practices. Implemented Google Campaigns and SEO for various types of websites. Developed landing pages, dashboards, and online applications using WordPress. "
      },
      {
        "company": "Insurance Office, Tehran, Tehran",
        "title": "Web Designer and Computer Technician",
        "years": "10/2017–6/2018",
        "description": "Transitioned from concepts and layout to deployment by experimenting with themes and genres. Maintained site appearance by developing and enforcing content and display standards and editing submissions. Configured hardware, devices, and software to set up new work stations for employees. Brokedown and evaluated user problems using test scripts, personal expertise, and probing questions. Used diagnostic tools to identify hardware failures and replace non-functional components. Backed up company data on a regular basis, successfully recovering critical information after malware attacks. Answered calls and emails at the company’s help desk, assisting employees and customers with troubleshooting computer issues."
      },
      {
        "company": "Pars Tire, Saveh, Markazi",
        "title": "Web Developer",
        "years": "9/2016–9/2017",
        "description": "Developed a robust Java code for production planning web applications. Created databases, data entry systems, web forms, and other applications for diverse uses. Built databases and table structures following MVC architecture methodology for web applications. Developed a production planning program using programming languages such as Java and Html and frameworks like Spring MVC, Hibernate, and Bootstrap. "
      },
      {
        "company": "International Institute of Afagh Elite (MABNA), Tehran, Tehran",
        "title": "Web Designer/Developer",
        "years": "6/2016–9/2016",
        "description": "Established milestones for projects and prepared all team members to meet aggressive deadlines. Maintained strict budgetary and scheduling guidelines to satisfy customers with high-quality, targeted designs. Developed landing pages, dashboards, and online applications using HTML, CSS, and JavaScript. Created site layout and user interface using HTML and CSS practices. Completed full redesigns of existing websites to improve navigation, enhance visuals, and strengthen search engine rankings. Used programming capabilities in PHP, SQL and JavaScript, and other libraries as needed. "
      }
    ],
    "education": [
      {
        "school": "The K.N.Toosi University of Technology, Tehran",
        "degree": "Master MBA",
        "graduated": "2019",
        "description": ""
      },
      {
        "school": "Ferdowsi University, Mashhad",
        "degree": "Bachelor of Science – Computer Engineering",
        "graduated": "2014 - 2019",
        "description": ""
      }
    ],
    "skills": [
      {
        "name": "React",
        "level": "100%"
      },
      {
        "name": "React Native",
        "level": "80%"
      },
      {
        "name": "Javascript",
        "level": "80%"
      },
      {
        "name": "Golang",
        "level": "65%"
      },
      {
        "name": "Graphql",
        "level": "80%"
      },
      {
        "name": "Java",
        "level": "80%"
      },
      {
        "name": "Python",
        "level": "60%"
      },
      {
        "name": "MongoDB",
        "level": "60%"
      },
      {
        "name": "C",
        "level": "70%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Profile Company",
        "category": "This is social network company I developed with my team.",
        "image": "profile.png",
        "url": "https://profile.ir"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}